tests/setup/expected/assisted-checkout/ÏRTIMID Hotel/expected-values.json

{"planSummary":{"completionDate":"21/07/2023","planDate":"10/05/2023","lastPaymentDate":"10/07/2023","totalCost":"400.00","installmentPeriod":"Fortnightly","totalNoOfInstallments":"5","numberOfInstalment":"4","installmentAmount":"12.50","priceWidget":"10.00","percentageInstallmentPaid":"88","paymentMethod":"4242","planStatus":"On Schedule","planID":"30w4fpnt3gg5","remainingAmount":"50.00","totalFunds":"350.00","noOfInstallmentsPaid":"1","Remainder":"0.00","noOfInstallmentsToBePaid":"4","redemptionDate":"20/08/2023","checkoutCurrency":"AUD","message":"successful","paymentPlatform_vendor":"Stripe","paymentPlatform_variant":"Managed","checkoutType":"customer-checkout"},"depositSettings":{"depositRuleApplied":"defaultMinDeposit","depositSetting":"default","requiredMinimumDeposit":"350.00","MaxDepositAmount":"390","depositPaid":"350.00","depositExcludingRemainder":"350.00","evenInstalmentAmount":"80.00"},"fees":{"totalMerchantTransactionFee":"11.50","planPayFeesSoFar":"30.75","merchantRevenue":"319.25","TotalServiceFeesExcGST":"20","TotalServiceFeesIncGST":"22","ServiceFeesIncGSTonPaid":"19.25","ServiceFeesExcGSTonPaid":"17.5"},"merchantDetails":{"merchantName":"YapNalp Hotels","merchantId":"000abcd00ef0","sub_merchantName":"ÏRTIMID Hotel","sub_merchantId":"000aaaa00aa3","checkoutCategory":"submerchant"},"cancellationDetails":{"planCancellationDate":"","refundType":"","refundAmount":"","ActualRefundAmountUI":"","daysFromCancellationtoRedemtion":"19","FinalNonRefundAmount":"","CustomerRefundValue":"","nonRefundableDeposit":"0.00","totalNonRefundableDeposit":"","reason":""},"planDetails":{"productsQuantity":["2"],"productsAmount":["200.00"],"producItem":"Superior Deluxe King, Guest room, 1 King","items":[{"description":"Superior Deluxe King, Guest room, 1 King","redemptionDate":"20/August/2023"}]},"flags":{"cancelPlanFlag":"false","blockedCheckout":"false","eventProcessorError":"false"},"MerchantEnv":{"selectedMerchant":{},"productList":["Superior Deluxe King, Guest room, 1 King","Superior Deluxe Twin, Guest room, 2 Twin/Single Bed(s)","Superior Studio Twin, Larger Guest room, 2 Double","Club King, Club lounge access, Guest room, 1 King","Presidential Suite, Club lounge access, High floor"],"itemPrelocator":"","itemPostlocator":""},"customer":{"Email":"planpaytestingautomation3804@mailinator.com","firstName":"planpaytesting_firstNameLZmD","lastName":"planpaytesting_lastNameUdGW","phoneNumber":"+61345678999","userVerified":"false"},"customerLog":{"Email":"","firstName":"","lastName":"","phoneNumber":""},"UpcomingPayments":[{"amount":"12.50","date":"29/05/2023","instalment":"2/5","status":"On Schedule","paymentType":"DUETIME"},{"amount":"12.50","date":"12/06/2023","instalment":"3/5","status":"On Schedule","paymentType":"DUETIME"},{"amount":"12.50","date":"26/06/2023","instalment":"4/5","status":"On Schedule","paymentType":"DUETIME"},{"amount":"12.50","date":"10/07/2023","instalment":"5/5","status":"On Schedule","paymentType":"DUETIME"}],"paidPayments":[{"amount":"350.00","date":"10/05/2023","instalment":"1/5","paymentMethodUsed":"4242","status":"Paid","paymentType":"DUETIME","paymentGatewayFee":10.45,"MerchantTransactionFee":11.5}],"latePayments":[],"LocalEnv":{"applicationName":"merchant-testing","merchantName":"ÏRTIMID Hotel"}}