tests/setup/expected/assisted-checkout/Ñaamra Hotel/expected-values.json

{"planSummary":{"completionDate":"17/11/2023","planDate":"16/05/2023","lastPaymentDate":"14/11/2023","totalCost":"2500.00","installmentPeriod":"Weekly","totalNoOfInstallments":"27","numberOfInstalment":"26","installmentAmount":"62.46","priceWidget":"82.69","percentageInstallmentPaid":"45","paymentMethod":"4444","planStatus":"Completed","planID":"14csyxfzdogi","remainingAmount":"1374.12","totalFunds":"1125.88","noOfInstallmentsPaid":"5","Remainder":"0.04","noOfInstallmentsToBePaid":"22","redemptionDate":"01/01/2024","checkoutCurrency":"AUD","message":"successful","paymentPlatform_vendor":"Stripe","paymentPlatform_variant":"Managed","PaymentEligible":"true","checkoutType":"customer-checkout"},"depositSettings":{"depositRuleApplied":"random","depositSetting":"random","requiredMinimumDeposit":"350.00","MaxDepositAmount":"1000.00","depositPaid":"876.04","depositExcludingRemainder":"876.00","evenInstalmentAmount":"92.59"},"fees":{"totalMerchantTransactionFee":"29.93","planPayFeesSoFar":"79.98","merchantRevenue":"920.98","TotalServiceFeesExcGST":"125","ServiceFeesExcGSTonPaid":"50.05"},"merchantDetails":{"merchantName":"Ñaamra Hotel","merchantId":"000abcd00ef0","sub_merchantName":"Ñaamra Hotel","sub_merchantId":"000aaaa00aa1","checkoutCategory":"submerchant"},"cancellationDetails":{"planCancellationDate":"","refundType":"","refundAmount":"","ActualRefundAmountUI":"","daysFromCancellationtoRedemtion":"19","FinalNonRefundAmount":"","CustomerRefundValue":"","nonRefundableDeposit":"0.00","totalNonRefundableDeposit":"","reason":""},"planDetails":{"productsQuantity":["1","1"],"productsAmount":["1000.00","1500.00"],"producItem":"Superior Studio Twin Larger Guest room 2 Double$Club King Club lounge access Guest room 1 King","items":[{"description":"Superior Studio Twin Larger Guest room 2 Double","redemptionDate":"20/August/2024"},{"description":"Club King Club lounge access Guest room 1 King","redemptionDate":"1/January/2024"}]},"flags":{"cancelPlanFlag":"false","blockedCheckout":"false","eventProcessorError":"false"},"MerchantEnv":{"selectedMerchant":{},"productList":["Superior Deluxe King Guest room 1 King","Superior Deluxe Twin Guest room 2 Twin/Single Bed(s)","Superior Studio Twin Larger Guest room 2 Double","Club King Club lounge access Guest room 1 King","Presidential Suite Club lounge access High floor"],"itemPrelocator":"","itemPostlocator":""},"customer":{"Email":"planpaytestingautomation6509@mailinator.com","firstName":"planpaytesting_firstNamebumW","lastName":"planpaytesting_lastNameKyNU","phoneNumber":"+61345678999","userVerified":"false"},"customerLog":{"Email":"","firstName":"","lastName":"","phoneNumber":""},"UpcomingPayments":[{"amount":"62.46","date":"20/06/2023","instalment":"6/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"27/06/2023","instalment":"7/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"04/07/2023","instalment":"8/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"11/07/2023","instalment":"9/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"18/07/2023","instalment":"10/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"25/07/2023","instalment":"11/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"01/08/2023","instalment":"12/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"08/08/2023","instalment":"13/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"15/08/2023","instalment":"14/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"22/08/2023","instalment":"15/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"29/08/2023","instalment":"16/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"05/09/2023","instalment":"17/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"12/09/2023","instalment":"18/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"19/09/2023","instalment":"19/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"26/09/2023","instalment":"20/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"03/10/2023","instalment":"21/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"10/10/2023","instalment":"22/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"17/10/2023","instalment":"23/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"24/10/2023","instalment":"24/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"31/10/2023","instalment":"25/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"07/11/2023","instalment":"26/27","status":"On Schedule","paymentType":"DUETIME"},{"amount":"62.46","date":"14/11/2023","instalment":"27/27","status":"On Schedule","paymentType":"DUETIME"}],"paidPayments":[{"amount":"876.04","date":"16/05/2023","instalment":"1/27","paymentMethodUsed":"4444","status":"Paid","paymentType":"DUETIME","paymentGatewayFee":25.71,"MerchantTransactionFee":25.71,"paymentGatewayFeeExcludedSalesTax":23.372727272727,"serviceFee":"43.80"},{"amount":"62.46","date":"23/05/2023","instalment":"2/27","status":"Paid","paymentType":"DUETIME","paymentMethodUsed":"4444","paymentGatewayFee":2.11,"MerchantTransactionFee":2.11,"paymentGatewayFeeExcludedSalesTax":1.918181818182,"serviceFee":"3.12"},{"amount":"62.46","date":"30/05/2023","instalment":"3/27","status":"Paid","paymentType":"DUETIME","paymentMethodUsed":"4444","paymentGatewayFee":2.11,"MerchantTransactionFee":2.11,"paymentGatewayFeeExcludedSalesTax":1.918181818182,"serviceFee":"3.12"},{"amount":"62.46","date":"06/06/2023","instalment":"4/27","status":"Paid","paymentType":"DUETIME","paymentMethodUsed":"4444"},{"amount":"62.46","date":"13/06/2023","instalment":"5/27","status":"Paid","paymentType":"DUETIME","paymentMethodUsed":"4444"}],"latePayments":[],"LocalEnv":{"applicationName":"merchant-testing","merchantName":"Ñaamra Hotel"}}