tests/setup/expected/customer-checkout/Minty Hotels/expected-values.json

{"planSummary":{"completionDate":"22/10/2023","planDate":"07/09/2023","effectiveDate":"07/09/2023","lastPaymentDate":"19/10/2023","paymentsFrom":"07/09/2023","paymentMode":"","totalCost":"3000.00","installmentPeriod":"Fortnightly","InstallmentDay":"Thursday","totalNoOfInstallments":"4","numberOfInstalment":"3","installmentAmount":"900.00","priceWidget":"450.00","percentageInstallmentPaid":"10","paymentMethod":"0006","planStatus":"On Schedule","planID":"uxqh6792icvk","remainingAmount":"2700.00","totalFunds":"300.00","noOfInstallmentsPaid":"1","Remainder":"0.00","noOfInstallmentsToBePaid":"3","redemptionDate":"21/12/2023","checkoutCurrency":"AUD","currencySymbol":"$","message":"successful","paymentPlatform_vendor":"Mint","paymentPlatform_variant":"Enterprise","checkoutType":"customer-checkout","skippedAmount":"","skippedInstalments":"","selectedInstallmentPeriod":"Monthly","selectedInstalmentType":"Fortnightly","Weekly":{"totalNoOfInstallments":"7","numberOfInstalment":"6","instalmentDate":7,"option":"deselected","status":"Available","instalmentAmount":"450.00"},"Fortnightly":{"totalNoOfInstallments":"4","numberOfInstalment":"3","instalmentDate":14,"option":"selected","status":"Available","instalmentAmount":"900.00"},"Monthly":{"totalNoOfInstallments":"2","numberOfInstalment":"1","instalmentDate":7,"option":"selected","status":"Available","instalmentAmount":"2700.00"}},"depositSettings":{"depositRuleApplied":"defaultMinDeposit","depositSetting":"default","requiredMinimumDeposit":"300.00","MaxDepositAmount":"2990","depositPaid":"300.00","depositExcludingRemainder":"300.00","evenInstalmentAmount":"428.57","MaxDepositAmount_rounddown":"2950.00","requiredMinimumDeposit_roundup":"300.00"},"fees":{"totalMerchantTransactionFee":"0.00","planPayFeesSoFar":"15.00","merchantRevenue":"285.00","TotalServiceFeesExcGST":"150","ServiceFeesExcGSTonPaid":"15","MerchantRevenueExcludingFees":""},"merchantDetails":{"merchantName":"Minty Hotels","merchantId":"mw7n2hj3s36s","sub_merchantName":"","sub_merchantId":"","checkoutCategory":"merchant"},"cancellationDetails":{"planCancellationDate":"07/09/2023","refundType":"","refundAmount":"","ActualRefundAmountUI":"","FinalNonRefundAmount":"","CustomerRefundValue":"","nonRefundableDeposit":"","totalNonRefundableDeposit":"300.00","reason":"","totalRefundableAmount":"1900.00"},"planDetails":{"productsQuantity":["1","1"],"productsAmount":["1000.00","2000.00"],"producItem":"Superior Studio Twin Larger Guest room 2 Double$Presidential Suite Club lounge access High floor","items":[{"description":"Superior Studio Twin Larger Guest room 2 Double","redemptionDate":"17/October/2024","daysFromCancellationtoRedemtion":"406","depositAmount":"150.00","depositRefundable":"true","nonRefundableDeposit":"0.00","effectiveFinalNonRefundableAmountItem":"0.00","itemRefundableAmount":"1000.00","howThisIsCalculated":[{"milestoneDate1":"Oct 17, 2024","nonRefundableAmount1":"0.00"}]},{"description":"Presidential Suite Club lounge access High floor","redemptionDate":"21/December/2023","daysFromCancellationtoRedemtion":"105","depositAmount":"150.00","depositRefundable":"false","nonRefundableDeposit":"150.00","effectiveFinalNonRefundableAmountItem":"150.00","itemRefundableAmount":"1850.00","howThisIsCalculated":[{"milestoneDate1":"Dec 21, 2023","nonRefundableAmount1":"0.00"}]}],"poilcyType":""},"flags":{"cancelPlanFlag":"false","blockedCheckout":"false","eventProcessorError":"false","PaymentEligible":"false","blockedPayInstalment":"false","updateCadenceblocked":"false","selectionBlocked":"false","userExists":"false","latePayment":"false"},"MerchantEnv":{"selectedMerchant":{},"productList":["Superior Deluxe King Guest room 1 King","Superior Deluxe Twin Guest room 2 Twin/Single Bed(s)","Superior Studio Twin Larger Guest room 2 Double","Club King Club lounge access Guest room 1 King","Presidential Suite Club lounge access High floor"],"itemPrelocator":"","itemPostlocator":""},"customer":{"Email":"planpaytestingautomation3334@mailinator.com","firstName":"planpaytesting_firstNamevBQJ","lastName":"planpaytesting_lastNameucmU","phoneNumber":"+61345678999","userVerified":"false","userStatus":"Active","accountCreated":"07/09/2023","userId":"31tjld72a4hh"},"customerLog":{"Email":"","firstName":"","lastName":"","phoneNumber":""},"UpcomingPayments":[{"amount":"900.00","date":"21/09/2023","instalment":"2/4","status":"On Schedule","paymentType":"DUETIME","remainder":"0.00"},{"amount":"900.00","date":"05/10/2023","instalment":"3/4","status":"On Schedule","paymentType":"DUETIME","remainder":"0.00"},{"amount":"900.00","date":"19/10/2023","instalment":"4/4","status":"On Schedule","paymentType":"DUETIME","remainder":"0.00"}],"paidPayments":[{"amount":"300.00","date":"07/09/2023","actualPaidDate":"07/09/2023","instalment":"1/4","paymentMethodUsed":"0006","status":"Paid","paymentType":"DUETIME","remainder":"0.00","type":{"Charge":{"amountcapturedAvailable":"300.00","amountRefunded":"0.00"}},"paymentGatewayFee":0,"MerchantTransactionFee":0,"paymentGatewayFeeExcludedSalesTax":0,"serviceFee":15}],"latePayments":[],"skippedInstallment":[],"LocalEnv":{"applicationName":"merchant-testing","merchantName":"Minty Hotels","operationType":"","installmentType":"Fortnightly","screen":"CheckoutSummary"}}