tests/setup/expected/customer-checkout/Noraa Travel/expected-values.json

{"planSummary":{"completionDate":"01/11/2023","planDate":"11/09/2023","effectiveDate":"","lastPaymentDate":"","paymentsFrom":"","paymentMode":"","totalCost":"1050.00","installmentPeriod":"Weekly","InstallmentDay":"","totalNoOfInstallments":"8","numberOfInstalment":"7","installmentAmount":"71.42","priceWidget":"71.42","percentageInstallmentPaid":"52","paymentMethod":"","planStatus":"On Schedule","planID":"","remainingAmount":"499.94","totalFunds":"550.06","noOfInstallmentsPaid":"1","Remainder":"0.06","noOfInstallmentsToBePaid":"","redemptionDate":"01/11/2023","checkoutCurrency":"AUD","currencySymbol":"$","message":"","paymentPlatform_vendor":"Stripe","paymentPlatform_variant":"Managed","checkoutType":"customer-checkout","skippedAmount":"","skippedInstalments":"","selectedInstallmentPeriod":"Weekly","selectedInstalmentType":"Monthly","Weekly":{"totalNoOfInstallments":"8","numberOfInstalment":"7","instalmentDate":7,"option":"selected","status":"Available","instalmentAmount":"71.42"},"Fortnightly":{"totalNoOfInstallments":"4","numberOfInstalment":"3","instalmentDate":14,"option":"deselected","status":"Available","instalmentAmount":"166.66"},"Monthly":{"totalNoOfInstallments":"2","numberOfInstalment":"1","instalmentDate":11,"option":"deselected","status":"Available","instalmentAmount":"500.00"}},"depositSettings":{"depositRuleApplied":"min","depositSetting":"min","requiredMinimumDeposit":"505.00","MaxDepositAmount":"1000.00","depositPaid":"550.06","depositExcludingRemainder":"550.00","evenInstalmentAmount":"131.25","MaxDepositAmount_rounddown":"1000.00","requiredMinimumDeposit_roundup":"550.00"},"fees":{"totalMerchantTransactionFee":"","planPayFeesSoFar":"","merchantRevenue":"","TotalServiceFeesExcGST":"","ServiceFeesExcGSTonPaid":"","MerchantRevenueExcludingFees":""},"merchantDetails":{"merchantName":"Noraa Travel","merchantId":"630880668a41","sub_merchantName":"","sub_merchantId":"","checkoutCategory":"merchant"},"cancellationDetails":{"planCancellationDate":"","refundType":"","refundAmount":"","ActualRefundAmountUI":"","FinalNonRefundAmount":"","CustomerRefundValue":"","nonRefundableDeposit":"","totalNonRefundableDeposit":"","reason":""},"planDetails":{"productsQuantity":["1","2"],"productsAmount":["50.00","500.00"],"producItem":"Airline flight$Hotel booking","items":[{"description":"Airline flight","redemptionDate":"1/December/2024"},{"description":"Hotel booking","redemptionDate":"1/November/2023"}],"poilcyType":"","paymentLink":{"link":"","expiryDate":""}},"flags":{"cancelPlanFlag":"false","blockedCheckout":"false","eventProcessorError":"false","PaymentEligible":"false","blockedPayInstalment":"false","updateCadenceblocked":"false","selectionBlocked":"false","userExists":"false","latePayment":"false"},"MerchantEnv":{"selectedMerchant":{},"productList":["Airline flight","Hotel booking"],"itemPrelocator":"","itemPostlocator":""},"customer":{"Email":"planpaytestingautomation8933@mailinator.com","firstName":"planpaytesting_firstNameRWCh","lastName":"planpaytesting_lastNameNhqV","phoneNumber":"+61345678999","userVerified":"false","userStatus":"Active","accountCreated":"11/09/2023","userId":""},"customerLog":{"Email":"","firstName":"","lastName":"","phoneNumber":""},"UpcomingPayments":[],"paidPayments":[{"amount":"","date":"","actualPaidDate":"","instalment":"","paymentMethodUsed":"","status":"","paymentType":"","remainder":"","type":{"Charge":{"amountcapturedAvailable":"","amountRefunded":""},"Refund":{"amountcapturedAvailable":"","amountRefunded":""}}}],"latePayments":[],"skippedInstallment":[],"LocalEnv":{"applicationName":"merchant-testing","merchantName":"Noraa Travel","operationType":"","installmentType":"Weekly","screen":"CheckoutWidget"}}