tests/setup/expected/customer-checkout/ROTVIC Hotels/expected-values.json

{
  "planSummary": {
    "completionDate": "01/12/2023",
    "planDate": "04/09/2023",
    "effectiveDate": "04/09/2023",
    "lastPaymentDate": "27/11/2023",
    "paymentsFrom": "02/10/2023",
    "paymentMode": "",
    "totalCost": "3000.00",
    "installmentPeriod": "Fortnightly",
    "InstallmentDay": "Monday",
    "totalNoOfInstallments": "7",
    "numberOfInstalment": "4",
    "installmentAmount": "425.00",
    "priceWidget": "212.50",
    "percentageInstallmentPaid": "15",
    "paymentMethod": "4242",
    "planStatus": "On Schedule",
    "planID": "1uue45co50tm",
    "remainingAmount": "1700.00",
    "totalFunds": "1300.00",
    "noOfInstallmentsPaid": "3",
    "Remainder": "0.00",
    "noOfInstallmentsToBePaid": "4",
    "redemptionDate": "01/12/2023",
    "checkoutCurrency": "AUD",
    "currencySymbol": "$",
    "message": "successful",
    "paymentPlatform_vendor": "Stripe",
    "paymentPlatform_variant": "Enterprise",
    "checkoutType": "customer-checkout",
    "skippedAmount": "",
    "skippedInstalments": "",
    "selectedInstallmentPeriod": "Weekly",
    "selectedInstalmentType": "Monthly",
    "Weekly": {
      "totalNoOfInstallments": "13",
      "numberOfInstalment": "12",
      "instalmentDate": 7,
      "option": "selected",
      "status": "Available",
      "instalmentAmount": "212.50"
    },
    "Fortnightly": {
      "totalNoOfInstallments": "7",
      "numberOfInstalment": "6",
      "instalmentDate": 14,
      "option": "selected",
      "status": "Available",
      "instalmentAmount": "425.00"
    },
    "Monthly": {
      "totalNoOfInstallments": "3",
      "numberOfInstalment": "2",
      "instalmentDate": 4,
      "option": "deselected",
      "status": "Available",
      "instalmentAmount": "1275.00"
    }
  },
  "depositSettings": {
    "depositRuleApplied": "defaultMinDeposit",
    "depositSetting": "default",
    "requiredMinimumDeposit": "450.00",
    "MaxDepositAmount": "2990",
    "depositPaid": "450.00",
    "depositExcludingRemainder": "450.00",
    "evenInstalmentAmount": "230.76",
    "MaxDepositAmount_rounddown": "2950.00",
    "requiredMinimumDeposit_roundup": "450.00"
  },
  "fees": {
    "totalMerchantTransactionFee": "40.36",
    "planPayFeesSoFar": "65.00",
    "merchantRevenue": "1235.00",
    "TotalServiceFeesExcGST": "150",
    "ServiceFeesExcGSTonPaid": "65",
    "MerchantRevenueExcludingFees": ""
  },
  "merchantDetails": {
    "merchantName": "ROTVIC Hotels",
    "merchantId": "ffue5jqyrctz",
    "sub_merchantName": "",
    "sub_merchantId": "",
    "checkoutCategory": "merchant"
  },
  "cancellationDetails": {
    "planCancellationDate": "04/09/2023",
    "refundType": "",
    "refundAmount": "",
    "ActualRefundAmountUI": "",
    "FinalNonRefundAmount": "",
    "CustomerRefundValue": "",
    "nonRefundableDeposit": "",
    "totalNonRefundableDeposit": "0.00",
    "reason": "",
    "totalRefundableAmount": "550.00"
  },
  "planDetails": {
    "productsQuantity": ["1", "1", "1"],
    "productsAmount": ["500.00", "1000.00", "1500.00"],
    "producItem": "Superior Deluxe Twin Guest room 2 Twin/Single Bed(s)$Superior Studio Twin Larger Guest room 2 Double$Club King Club lounge access Guest room 1 King",
    "items": [
      {
        "description": "Superior Deluxe Twin Guest room 2 Twin/Single Bed(s)",
        "redemptionDate": "1/August/2024",
        "daysFromCancellationtoRedemtion": "332",
        "depositAmount": "150.00",
        "depositRefundable": "true",
        "nonRefundableDeposit": "0.00",
        "effectiveFinalNonRefundableAmountItem": "0.00",
        "itemRefundableAmount": "500.00",
        "howThisIsCalculated": [
          { "milestoneDate1": "12 June 2024", "nonRefundableAmount1": "0.00" },
          {
            "milestoneDate2": "12 July 2024",
            "nonRefundableAmount2": "150.00"
          },
          { "milestoneDate3": "22 July 2024", "nonRefundableAmount3": "250.00" }
        ]
      },
      {
        "description": "Superior Studio Twin Larger Guest room 2 Double",
        "redemptionDate": "1/December/2023",
        "daysFromCancellationtoRedemtion": "88",
        "depositAmount": "150.00",
        "depositRefundable": "true",
        "nonRefundableDeposit": "0.00",
        "effectiveFinalNonRefundableAmountItem": "0.00",
        "itemRefundableAmount": "1000.00",
        "howThisIsCalculated": [
          { "milestoneDate1": "02 Oct 2023", "nonRefundableAmount1": "600.00" },
          { "milestoneDate2": "01 Nov 2023", "nonRefundableAmount2": "700.00" },
          { "milestoneDate3": "16 Nov 2023", "nonRefundableAmount3": "800.00" }
        ]
      },
      {
        "description": "Club King Club lounge access Guest room 1 King",
        "redemptionDate": "25/March/2024",
        "daysFromCancellationtoRedemtion": "203",
        "depositAmount": "150.00",
        "depositRefundable": "true",
        "nonRefundableDeposit": "0.00",
        "effectiveFinalNonRefundableAmountItem": "0.00",
        "itemRefundableAmount": "1500.00",
        "howThisIsCalculated": [
          { "milestoneDate1": "25 Jan 2024", "nonRefundableAmount1": "900.00" },
          {
            "milestoneDate2": "24 Feb 2024",
            "nonRefundableAmount2": "1050.00"
          },
          { "milestoneDate3": "10 Mar 2024", "nonRefundableAmount3": "1200.00" }
        ]
      }
    ],
    "poilcyType": ""
  },
  "flags": {
    "cancelPlanFlag": "false",
    "blockedCheckout": "false",
    "eventProcessorError": "false",
    "PaymentEligible": "false",
    "blockedPayInstalment": "false",
    "updateCadenceblocked": "false",
    "selectionBlocked": "false",
    "userExists": "false",
    "latePayment": "false"
  },
  "MerchantEnv": {
    "selectedMerchant": {},
    "productList": [
      "Superior Deluxe King Guest room 1 King",
      "Superior Deluxe Twin Guest room 2 Twin/Single Bed(s)",
      "Superior Studio Twin Larger Guest room 2 Double",
      "Club King Club lounge access Guest room 1 King",
      "Presidential Suite Club lounge access High floor"
    ],
    "itemPrelocator": "",
    "itemPostlocator": ""
  },
  "customer": {
    "Email": "planpaytestingautomation5381@mailinator.com",
    "firstName": "planpaytesting_firstNamekqIG",
    "lastName": "planpaytesting_lastNameaqZd",
    "phoneNumber": "+61345678999",
    "userVerified": "false",
    "userStatus": "Active",
    "accountCreated": "04/09/2023",
    "userId": "ws53dr8y9jmq"
  },
  "customerLog": {
    "Email": "",
    "firstName": "",
    "lastName": "",
    "phoneNumber": ""
  },
  "UpcomingPayments": [
    {
      "amount": "425.00",
      "date": "16/10/2023",
      "instalment": "4/7",
      "status": "On Schedule",
      "paymentType": "DUETIME",
      "remainder": "0.00"
    },
    {
      "amount": "425.00",
      "date": "30/10/2023",
      "instalment": "5/7",
      "status": "On Schedule",
      "paymentType": "DUETIME",
      "remainder": "0.00"
    },
    {
      "amount": "425.00",
      "date": "13/11/2023",
      "instalment": "6/7",
      "status": "On Schedule",
      "paymentType": "DUETIME",
      "remainder": "0.00"
    },
    {
      "amount": "425.00",
      "date": "27/11/2023",
      "instalment": "7/7",
      "status": "On Schedule",
      "paymentType": "DUETIME",
      "remainder": "0.00"
    }
  ],
  "paidPayments": [
    {
      "amount": "450.00",
      "date": "04/09/2023",
      "actualPaidDate": "04/09/2023",
      "instalment": "1/7",
      "paymentMethodUsed": "4242",
      "status": "Paid",
      "paymentType": "DUETIME",
      "remainder": "0.00",
      "type": {
        "Charge": {
          "amountcapturedAvailable": "450.00",
          "amountRefunded": "0.00"
        }
      },
      "paymentGatewayFee": 13.35,
      "MerchantTransactionFee": 13.96,
      "paymentGatewayFeeExcludedSalesTax": 12.136363636364,
      "serviceFee": 22.5
    },
    {
      "amount": "425.00",
      "date": "18/09/2023",
      "actualPaidDate": "04/09/2023",
      "instalment": "2/7",
      "paymentMethodUsed": "4242",
      "status": "Paid",
      "paymentType": "ADVANCE",
      "remainder": "0.00",
      "type": {
        "Charge": {
          "amountcapturedAvailable": "425.00",
          "amountRefunded": "0.00"
        }
      },
      "paymentGatewayFee": 12.63,
      "MerchantTransactionFee": 13.2,
      "paymentGatewayFeeExcludedSalesTax": 11.481818181818,
      "serviceFee": 21.25
    },
    {
      "amount": "425.00",
      "date": "02/10/2023",
      "actualPaidDate": "04/09/2023",
      "instalment": "3/7",
      "paymentMethodUsed": "4242",
      "status": "Paid",
      "paymentType": "ADVANCE",
      "remainder": "0.00",
      "type": {
        "Charge": {
          "amountcapturedAvailable": "425.00",
          "amountRefunded": "0.00"
        }
      },
      "paymentGatewayFee": 12.63,
      "MerchantTransactionFee": 13.2,
      "paymentGatewayFeeExcludedSalesTax": 11.481818181818,
      "serviceFee": 21.25
    }
  ],
  "latePayments": [],
  "skippedInstallment": [],
  "LocalEnv": {
    "applicationName": "merchant-testing",
    "merchantName": "ROTVIC Hotels",
    "operationType": "",
    "installmentType": "Fortnightly",
    "screen": "CheckoutSummary"
  }
}
