tests/setup/expected/customer-checkout/Shonrate Hotels/expected-values.json

{
  "planSummary": {
    "completionDate": "24/11/2023",
    "planDate": "18/08/2023",
    "lastPaymentDate": "30/10/2023",
    "paymentsFrom": "02/10/2023",
    "totalCost": "400.00",
    "installmentPeriod": "Fortnightly",
    "InstallmentDay": "Monday",
    "installmentAmount": "10.00",
    "priceWidget": "10.00",
    "percentageInstallmentPaid": "95",
    "paymentMethod": "4242",
    "planStatus": "On Schedule",
    "planID": "l06ewf3iqjg3",
    "remainingAmount": "20.00",
    "totalFunds": "380.00",
    "noOfInstallmentsPaid": "4",
    "Remainder": "0.00",
    "noOfInstallmentsToBePaid": "2",
    "redemptionDate": "24/12/2023",
    "checkoutCurrency": "AUD",
    "currencySymbol": "$",
    "message": "successful",
    "paymentPlatform_vendor": "Stripe",
    "paymentPlatform_variant": "Managed",
    "checkoutType": "customer-checkout",
    "skippedAmount": "",
    "skippedInstalments": "",
    "selectedInstalmentType": "Monthly",
    "Weekly": {
      "totalNoOfInstallments": "6",
      "numberOfInstalment": "5",
      "instalmentDate": 7,
      "option": "deselected",
      "status": "Available",
      "instalmentAmount": "10.00"
    },
    "Fortnightly": {
      "totalNoOfInstallments": "6",
      "numberOfInstalment": "5",
      "instalmentDate": 14,
      "option": "selected",
      "status": "Available",
      "instalmentAmount": "10.00"
    },
    "Monthly": {
      "totalNoOfInstallments": "4",
      "numberOfInstalment": "3",
      "instalmentDate": 18,
      "option": "deselected",
      "status": "Available",
      "instalmentAmount": "16.66"
    },
    "selectedInstallmentPeriod": "Weekly",
    "totalNoOfInstallments": "6",
    "numberOfInstalment": "2"
  },
  "depositSettings": {
    "depositRuleApplied": "defaultMinDeposit",
    "depositSetting": "default",
    "requiredMinimumDeposit": "350.00",
    "MaxDepositAmount": "390",
    "depositPaid": "350.00",
    "depositExcludingRemainder": "350.00",
    "evenInstalmentAmount": "26.66",
    "MaxDepositAmount_rounddown": "350.00",
    "requiredMinimumDeposit_roundup": "350.00"
  },
  "fees": {
    "totalMerchantTransactionFee": "12.79",
    "planPayFeesSoFar": "31.79",
    "merchantRevenue": "348.21",
    "TotalServiceFeesExcGST": "20",
    "ServiceFeesExcGSTonPaid": "19",
    "MerchantRevenueExcludingFees": ""
  },
  "merchantDetails": {
    "merchantName": "Shonrate Hotels",
    "merchantId": "631adba97bf3",
    "sub_merchantName": "",
    "sub_merchantId": "",
    "checkoutCategory": "merchant"
  },
  "cancellationDetails": {
    "planCancellationDate": "",
    "refundType": "",
    "refundAmount": "",
    "ActualRefundAmountUI": "",
    "FinalNonRefundAmount": "",
    "CustomerRefundValue": "",
    "nonRefundableDeposit": "",
    "totalNonRefundableDeposit": "",
    "reason": ""
  },
  "planDetails": {
    "productsQuantity": ["2"],
    "productsAmount": ["200.00"],
    "producItem": "Superior Deluxe King Guest room 1 King",
    "items": [
      {
        "description": "Superior Deluxe King Guest room 1 King",
        "redemptionDate": "24/December/2023",
        "daysFromCancellationtoRedemtion": "128",
        "depositAmount": "350.00",
        "depositRefundable": "false",
        "nonRefundableDeposit": "350.00",
        "effectiveFinalNonRefundableAmountItem": "350.00",
        "itemRefundableAmount": "-150.00",
        "howThisIsCalculated": [
          { "milestoneDate1": "04 Nov 2023", "nonRefundableAmount1": "0.00" },
          { "milestoneDate2": "04 Dec 2023", "nonRefundableAmount2": "120.00" },
          { "milestoneDate3": "14 Dec 2023", "nonRefundableAmount3": "200.00" }
        ]
      }
    ]
  },
  "flags": {
    "cancelPlanFlag": "false",
    "blockedCheckout": "false",
    "eventProcessorError": "false",
    "PaymentEligible": "false",
    "blockedPayInstalment": "false",
    "updateCadenceblocked": "false",
    "selectionBlocked": "false",
    "userExists": "false"
  },
  "MerchantEnv": {
    "selectedMerchant": {},
    "productList": [
      "Superior Deluxe King Guest room 1 King",
      "Superior Deluxe Twin Guest room 2 Twin/Single Bed(s)",
      "Superior Studio Twin Larger Guest room 2 Double",
      "Club King Club lounge access Guest room 1 King",
      "Presidential Suite Club lounge access High floor"
    ],
    "itemPrelocator": "",
    "itemPostlocator": ""
  },
  "customer": {
    "Email": "planpaytestingautomation2964@mailinator.com",
    "firstName": "planpaytesting_firstNameKfUa",
    "lastName": "planpaytesting_lastNameuxYx",
    "phoneNumber": "+61345678999",
    "userVerified": "false",
    "userStatus": "Active",
    "accountCreated": "18/08/2023"
  },
  "customerLog": {
    "Email": "",
    "firstName": "",
    "lastName": "",
    "phoneNumber": ""
  },
  "UpcomingPayments": [
    {
      "amount": "10.00",
      "date": "16/10/2023",
      "instalment": "5/6",
      "status": "On Schedule",
      "paymentType": "DUETIME",
      "remainder": "0.00"
    },
    {
      "amount": "10.00",
      "date": "30/10/2023",
      "instalment": "6/6",
      "status": "On Schedule",
      "paymentType": "DUETIME",
      "remainder": "0.00"
    }
  ],
  "paidPayments": [
    {
      "amount": "350.00",
      "date": "18/08/2023",
      "actualPaidDate": "18/08/2023",
      "instalment": "1/6",
      "paymentMethodUsed": "4242",
      "status": "Paid",
      "paymentType": "DUETIME",
      "remainder": "0.00",
      "type": {
        "Charge": {
          "amountcapturedAvailable": "350.00",
          "amountRefunded": "0.00"
        }
      },
      "paymentGatewayFee": 10.45,
      "MerchantTransactionFee": 10.93,
      "paymentGatewayFeeExcludedSalesTax": 9.5,
      "serviceFee": 17.5
    },
    {
      "amount": "10.00",
      "date": "04/09/2023",
      "instalment": "2/6",
      "status": "Paid",
      "paymentType": "DUETIME",
      "remainder": "0.00",
      "type": {
        "Charge": {
          "amountcapturedAvailable": "10.00",
          "amountRefunded": "0.00"
        }
      },
      "paymentMethodUsed": "4242",
      "actualPaidDate": "04/09/2023",
      "paymentGatewayFee": 0.59,
      "MerchantTransactionFee": 0.62,
      "paymentGatewayFeeExcludedSalesTax": 0.536363636364,
      "serviceFee": 0.5
    },
    {
      "amount": "10.00",
      "date": "18/09/2023",
      "instalment": "3/6",
      "status": "Paid",
      "paymentType": "DUETIME",
      "remainder": "0.00",
      "type": {
        "Charge": {
          "amountcapturedAvailable": "10.00",
          "amountRefunded": "0.00"
        }
      },
      "paymentMethodUsed": "4242",
      "actualPaidDate": "18/09/2023",
      "paymentGatewayFee": 0.59,
      "MerchantTransactionFee": 0.62,
      "paymentGatewayFeeExcludedSalesTax": 0.536363636364,
      "serviceFee": 0.5
    },
    {
      "amount": "10.00",
      "date": "02/10/2023",
      "instalment": "4/6",
      "status": "Paid",
      "paymentType": "DUETIME",
      "remainder": "0.00",
      "type": {
        "Charge": {
          "amountcapturedAvailable": "10.00",
          "amountRefunded": "0.00"
        }
      },
      "paymentMethodUsed": "4242",
      "actualPaidDate": "02/10/2023",
      "paymentGatewayFee": 0.59,
      "MerchantTransactionFee": 0.62,
      "paymentGatewayFeeExcludedSalesTax": 0.536363636364,
      "serviceFee": 0.5
    }
  ],
  "latePayments": [],
  "skippedInstallment": [],
  "LocalEnv": {
    "applicationName": "merchant-testing",
    "merchantName": "Shonrate Hotels",
    "operationType": "",
    "screen": "CheckoutSummary",
    "installmentType": "Fortnightly"
  }
}
